# Merge - Joins

In [1]:
import pandas as pd
df1=pd.DataFrame({'Fruits':['mango','guava','banana'],
                 'Price':[30,40,35]})
df1

   Fruits  Price
0   mango     30
1   guava     40
2  banana     35

In [10]:
df2=pd.DataFrame({'Fruits':['mango','grapes','banana','watermelon'],
                 'Price':[32,40,346,50]})
df2

       Fruits  Price
0       mango     32
1      grapes     40
2      banana    346
3  watermelon     50

In [14]:
df=pd.merge(df1,df2,how='left',on='Fruits')
df

   Fruits  Price_x  Price_y
0   mango       30     32.0
1   guava       40      NaN
2  banana       35    346.0

In [18]:
df=pd.merge(df1,df2,how='right',on='Price')
df

  Fruits_x  Price    Fruits_y
0      NaN     32       mango
1    guava     40      grapes
2      NaN    346      banana
3      NaN     50  watermelon

In [19]:
df=pd.merge(df1,df2,how='inner',on='Fruits')
df

   Fruits  Price_x  Price_y
0   mango       30       32
1  banana       35      346

In [20]:
df=pd.merge(df1,df2,how='outer',on='Fruits')
df

       Fruits  Price_x  Price_y
0       mango     30.0     32.0
1       guava     40.0      NaN
2      banana     35.0    346.0
3      grapes      NaN     40.0
4  watermelon      NaN     50.0

# concatination

using series

In [28]:
import pandas as pd
df1=pd.Series([1,2,3])
df1

0    1
1    2
2    3
dtype: int64

In [29]:
import pandas as pd
df2=pd.Series(['a','b','c'])
df2

0    a
1    b
2    c
dtype: object

In [33]:
df=pd.concat([df1,df2])
df

0    1
1    2
2    3
0    a
1    b
2    c
dtype: object

In [35]:
#ignore index
df=pd.concat([df1,df2],ignore_index=True)
df

0    1
1    2
2    3
3    a
4    b
5    c
dtype: object

In [37]:
#keys
df=pd.concat([df1,df2],keys=['A','B'])
df

A  0    1
   1    2
   2    3
B  0    a
   1    b
   2    c
dtype: object

In [41]:
#keys
df=pd.concat([df1,df2],axis=1)
df

   0  1
0  1  a
1  2  b
2  3  c

In [60]:
#data Frame
sim=pd.DataFrame({'m1':[12,34,56],
                 'm2':[12,34,67]})
sim

   m1  m2
0  12  12
1  34  34
2  56  67

In [64]:
sri=pd.DataFrame({'m1':[24,65,76],
                 'm2':[12,45,67],
                 'm3':[12,3,4]})
sri

   m1  m2  m3
0  24  12  12
1  65  45   3
2  76  67   4

In [65]:
df=pd.concat([sim,sri])
df

   m1  m2    m3
0  12  12   NaN
1  34  34   NaN
2  56  67   NaN
0  24  12  12.0
1  65  45   3.0
2  76  67   4.0

In [67]:
df=pd.concat([sim,sri],ignore_index=True)
df

   m1  m2    m3
0  12  12   NaN
1  34  34   NaN
2  56  67   NaN
3  24  12  12.0
4  65  45   3.0
5  76  67   4.0

In [66]:
df=pd.concat([sim,sri],axis=1)
df

   m1  m2  m1  m2  m3
0  12  12  24  12  12
1  34  34  65  45   3
2  56  67  76  67   4

In [68]:
#keys
df=pd.concat([sim,sri],axis=1,keys=['sim','sri'])
df

  sim     sri
   m1  m2  m1  m2  m3
0  12  12  24  12  12
1  34  34  65  45   3
2  56  67  76  67   4

In [1]:
#mean
df1.mean()

NameError: name 'df1' is not defined